Revit 2024 API
Solid.Edges Property
The edges that belong to the solid.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public EdgeArray Edges { get; }
Visual Basic
Public ReadOnly Property Edges As EdgeArray
	Get
Visual C++
public:
property EdgeArray^ Edges {
	EdgeArray^ get ();
}
See Also
Solid Class
Autodesk.Revit.DB Namespace